WcfHarness/WcfHarness/RequestXmls/GetScopes_ByOrganizationId.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetScopes xmlns="http://www.tavisca.com/Vexiere/IScope/2013/01">
      <getScopesRequest i:type="a:GetOrganizationScopesRQ" xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:PagingInfo>
          <a:PageNumber>0</a:PageNumber>
          <a:PageSize>0</a:PageSize>
        </a:PagingInfo>
        <a:SortingInfo>
          <a:OrderBy i:nil="true"/>
          <a:SortDescending>false</a:SortDescending>
        </a:SortingInfo>
        <a:FilterParameter i:nil="true"/>
        <a:OrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OrganizationIdentifier>
      </getScopesRequest>
    </GetScopes>
  </s:Body>
</s:Envelope>